blog/introduction.protoverse.project.org
#+TITLE: Creating an Open-ended Artificial Universe
#+SUBTITLE: Protoverse: Introduction
#+DATE: <2023-08-22 Tue>
#+LANGUAGE: en
#+DESCRIPTION: Creating an artificial, open-ended universe from scratch.
#+KEYWORDS: computable universe, computational philosophy, digital physics, alife, abstract universe, non-biological evolution, artificial life, dynamic systems, metaphysics
#+HTML_HEAD_EXTRA: <link rel="canonical" href="https://monkeyjunglejuice.github.io/blog/introduction.protoverse.project.html">
#+SETUPFILE: ../static/setup.org
#+PROPERTY: header-args+ :eval no-export
#+OPTIONS:

#+ATTR_HTML: :class pager
#+begin_nav
This is part of the Protoverse project:
- *[[file:introduction.protoverse.project.org][Introduction]]*
- [[file:metaphysics.protoverse.project.org][Metaphysics]]
- [[file:engineering.protoverse.project.org][Technical Considerations]]
- [[file:resources.protoverse.project.org][Resources]]
- [[file:model.protoverse.project.org][Computational Model]]
- [[file:ethics.protoverse.project.org][Ethical Guidelines]]
#+end_nav

#+TOC: nil

* What is This Place?

*Well, what is it not about?*
- Has nothing to do with "metaverse"-style virtual reality
- It's no simulation of quantum mechanics or physical phenomena
- No simulation celestial bodies or galaxies
- And it's no ALife simulation, either

The Protoverse is a computational experiment with the intent to build an artificial universe that exibits open-ended, quasi-darwinian evolution.

My aim is to use an exptreme bottom-up approach to build multi-scale computational substrates where intrinsic, open-ended evolutionary processes are the consequential outcome of systemic interactions.

The Protoverse is supposed to be purely abstract, which doesn't mean that it's crazy exotic or totally absurd (well, not yet). You might even find the modest ontology quite boring.

The Protoverse' design may resemble our universe in some aspects, but also deviate strongly in others -- I'm not interested in simulating real world phenomena, but the /integration/ of orthodox concepts, new ideas and even personal intuitions.

** Core Ideas

#+begin_index
- Pluralism instead of fixed rules: The Protoverse aims to be a multiscale model pioneering open-ended co-evolution. Through evolutionary dynamics, catalytic phase transitions lead to new Nested Scales of Complexity with emergent, novel rules and dynamics. While these novel rules/dynamics are predominant and therefore characteristic for each Scale, they remain interconnected and influenced by the foundational dynamics of their underlying Scales.
  /Keywords: Meta-evolution, Evolution of Evolvability, Multilevel Selection, Interscale-Connectivity, Universal Darwinism/

- The Protoverse is not made from things (like particles or objects and such), but Processes. It represents a shift from a substantial-materialist worldview to a process-relational understanding that informs the choice of abstractions.
  /Keywords: Process Philosophy, Relationalism, Constructivism/

- There's no traditional separation of agent/environment, and no pre-conception of time, space or gravity. Processes co-evolve into higher-order Processes by continuously becoming their own nested computing substrates.
  /Keywords: Backdrop Independence, Computational Universe, Complex Systems/
#+end_index

Please check out the [[file:metaphysics.protoverse.project.org][metaphysics]] for the intergration of these ideas.

* FAQ

** How Can it be Applied?

I don't know yet (that's what I consider a fun project). I can imagine some modest applications, and some pretty wild ones too. But I don't care about that right now.

** Why are you doing this?

I came to realize that I should do the stuff I'm most curious about. For me, open-ended computational evolution is probably the most interesting problem I can imagine, and I want to explore the ideas and intuitions I'm carrying around for a long time.

** Why not an artificial universe based on physics?

The Protoverse project moves beyond physics because it views physical laws, space, time, and matter not as privileged, but as parts of a multi-scale reality. Over-reliance on physics can overshadow the complexity inherent in nature's layers, where novel properties arise through interactions at different Nested Scales of Complexity.

The idea that a Theory of Everything (TOE) or Grand Unified Theory (GUT) can be derived from physics alone overlooks how emergent properties arise from complex interactions across various Scales. Integrated theories of complex adaptive systems, rather than purely physical theories, might offer more comprehensive insights.

Thus, the Protoverse project has to transcend traditional disciplinary boundaries, integrating ideas from computational philosophy, evolutionary theory, process philosophy, automata theory, complex systems, chaos theory, quantum theory, and systems architecture with emphasis on concurrency and massive parallelism. This interdisciplinary approach acknowledges the richness of reality and its many scales.

** But isn't that mere speculation? Not science?

You are right, the project is not science, but rather an expedition or field trip. Speculation has its place in the ongoing feedback loop and is intrinsic to philosophical, mathematical and scientific methods, which aims to realize the Protoverse by means of engineering.

** How do you fund that?

The Protoverse project will at any time receive the attention it deserves and the degree of resources needed.

1. The first rule of the Protoverse is: You do not talk about the Protoverse.
2. The second rule of the Protoverse is: You do not talk about the Protoverse.
3. Third rule: Rules are subject to evolution and lead to higher-order, emergent phenomena.

** Don't you have ehical concerns?

At this point, not really -- that would be overreaching. But eventually, yes. That's why there are [[file:ethics.protoverse.project.org][Ethical Guidelines]] in the making.
