blog/introduction.protoverse.project.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2025-04-21 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Creating an Artificial Open-ended Universe Bottom-up</title>
<meta name="author" content="Dan Dee" />
<meta name="description" content="Creating an artificial, open-ended universe from scratch." />
<meta name="keywords" content="computable universe, computational philosophy, digital physics, alife, abstract universe, non-biological evolution, artificial life, dynamic systems, metaphysics" />
<meta name="generator" content="Org Mode" />
<meta http-equiv="Content-Security-Policy" content="default-src 'self'; script-src 'self' https://wa.skred.net/; connect-src https://wa.skred.net/; style-src 'self' https://*; font-src 'self' https://*; img-src 'self' https://*; media-src 'self' https://*;">
<link rel="stylesheet" href="/static/normalize.css" type="text/css">
<link rel="stylesheet" href="/static/org.css" type="text/css">
<link rel="stylesheet" href="/static/style.css" type="text/css">
<link rel="preconnect" href="https://fonts.googleapis.com">
<link rel="preconnect" href="https://fonts.gstatic.com" crossorigin>
<link href="https://fonts.googleapis.com/css2?family=Fira+Code:wght@300..700&family=Gentium+Plus:ital,wght@0,400;0,700;1,400;1,700&family=PT+Sans+Caption:wght@400;700&family=PT+Sans:ital,wght@0,400;0,700;1,400;1,700&display=swap" rel="stylesheet">
<link rel="stylesheet" href="/static/fonts/iosevka-etoile/fonts.css" type="text/css">
<link rel="stylesheet" href="/static/fonts/cormorant/fonts.css" type="text/css">
<link rel="stylesheet" href="/static/fonts/gentium-basic/fonts.css" type="text/css">
<link rel="stylesheet" href="/static/fonts/iosevka-aile/fonts.css" type="text/css">
<link rel="stylesheet" href="/static/fonts/iosevka/fonts.css" type="text/css">
<link rel="icon" type="image/svg+xml" href="/static/monkeyjunglejuice.svg">
<link rel="apple-touch-icon" href="/static/monkeyjunglejuice-icon180.png">
<link rel="canonical" href="https://monkeyjunglejuice.github.io/blog/introduction.protoverse.project.html">
</head>
<body>
<div id="preamble" class="status">
<nav id="nav-primary"><a id="site-name" href="/index.html">MonkeyJungleJuice</a> <a id="bio" href="/bio.html">Bio</a><a id="github" href="https://github.com/monkeyjunglejuice">Github</a></nav>
<div class="info"><time itemprop="dateModified" datetime="2025-04-16">Last updated: 2025-04-16</time></div>
</div>
<div id="content" class="content">
<header>
<h1 class="title">Creating an Artificial Open-ended Universe Bottom-up</h1>
<p class="subtitle" role="doc-subtitle">Protoverse: Introduction</p>
</header><nav class="pager" id="org8078c12">
<p>
This is part of the Protoverse project:<br>
</p>
<ul class="org-ul">
<li><b><a href="introduction.protoverse.project.html">Introduction</a></b><br></li>
<li><a href="metaphysics.protoverse.project.html">Metaphysics</a><br></li>
<li><a href="engineering.protoverse.project.html">Technical Considerations</a><br></li>
<li><a href="resources.protoverse.project.html">Resources</a><br></li>
<li><a href="model.protoverse.project.html">Computational Model</a><br></li>
<li><a href="ethics.protoverse.project.html">Ethical Guidelines</a><br></li>
</ul>
</nav>
<div id="outline-container-orgfe07d26" class="outline-2">
<h2 id="orgfe07d26"><a href="#orgfe07d26">What is This Place?</a></h2>
<div class="outline-text-2" id="text-orgfe07d26">
<p>
<b>Well, what is it not about?</b><br>
</p>
<ul class="org-ul">
<li>Has nothing to do with &ldquo;metaverse&rdquo;-style virtual reality<br></li>
<li>It&rsquo;s no simulation of quantum mechanics or physical phenomena<br></li>
<li>No simulation celestial bodies or galaxies<br></li>
<li>And it&rsquo;s no ALife simulation, either<br></li>
</ul>

<p>
The Protoverse is a computational experiment with the intent to build an artificial universe that exibits open-ended, quasi-darwinian evolution.<br>
</p>

<p>
My aim is to use an exptreme bottom-up approach to build multi-scale computational substrates where intrinsic, open-ended evolutionary processes are the consequential outcome of systemic interactions.<br>
</p>

<p>
The Protoverse is supposed to be purely abstract, which doesn&rsquo;t mean that it&rsquo;s crazy exotic or totally absurd (well, not yet). You might even find the modest ontology quite boring.<br>
</p>

<p>
The Protoverse&rsquo; design may resemble our universe in some aspects, but also deviate strongly in others &#x2013; I&rsquo;m not interested in simulating real world phenomena, but the <i>integration</i> of orthodox concepts, new ideas and even personal intuitions.<br>
</p>
</div>
<div id="outline-container-orgba7370e" class="outline-3">
<h3 id="orgba7370e"><a href="#orgba7370e">Core Ideas</a></h3>
<div class="outline-text-3" id="text-orgba7370e">
<div class="index" id="org4328d37">
<ul class="org-ul">
<li>Pluralism instead of fixed rules: The Protoverse aims to be a multiscale model pioneering open-ended co-evolution. Through evolutionary dynamics, catalytic phase transitions lead to new Nested Scales of Complexity with emergent, novel rules and dynamics. While these novel rules/dynamics are predominant and therefore characteristic for each Scale, they remain interconnected and influenced by the foundational dynamics of their underlying Scales.<br>
<i>Keywords: Meta-evolution, Evolution of Evolvability, Multilevel Selection, Interscale-Connectivity, Universal Darwinism</i><br></li>

<li>The Protoverse is not made from things (like particles or objects and such), but Processes. It represents a shift from a substantial-materialist worldview to a process-relational understanding that informs the choice of abstractions.<br>
<i>Keywords: Process Philosophy, Relationalism, Constructivism</i><br></li>

<li>There&rsquo;s no traditional separation of agent/environment, and no pre-conception of time, space or gravity. Processes co-evolve into higher-order Processes by continuously becoming their own nested computing substrates.<br>
<i>Keywords: Backdrop Independence, Computational Universe, Complex Systems</i><br></li>
</ul>

</div>

<p>
Please check out the <a href="metaphysics.protoverse.project.html">metaphysics</a> for the intergration of these ideas.<br>
</p>
</div>
</div>
</div>
<div id="outline-container-orgbce79ac" class="outline-2">
<h2 id="orgbce79ac"><a href="#orgbce79ac">FAQ</a></h2>
<div class="outline-text-2" id="text-orgbce79ac">
</div>
<div id="outline-container-org3c68583" class="outline-3">
<h3 id="org3c68583"><a href="#org3c68583">How Can it be Applied?</a></h3>
<div class="outline-text-3" id="text-org3c68583">
<p>
I don&rsquo;t know yet (that&rsquo;s what I consider a fun project). I can imagine some modest applications, and some pretty wild ones too. But I don&rsquo;t care about that right now.<br>
</p>
</div>
</div>
<div id="outline-container-org257fa24" class="outline-3">
<h3 id="org257fa24"><a href="#org257fa24">Why are you doing this?</a></h3>
<div class="outline-text-3" id="text-org257fa24">
<p>
I came to realize that I should do the stuff I&rsquo;m most curious about. For me, open-ended computational evolution is probably the most interesting problem I can imagine, and I want to explore the ideas and intuitions I&rsquo;m carrying around for a long time.<br>
</p>
</div>
</div>
<div id="outline-container-orgae48963" class="outline-3">
<h3 id="orgae48963"><a href="#orgae48963">Why not an artificial universe based on physics?</a></h3>
<div class="outline-text-3" id="text-orgae48963">
<p>
The Protoverse project moves beyond physics because it views physical laws, space, time, and matter not as privileged, but as parts of a multi-scale reality. Over-reliance on physics can overshadow the complexity inherent in nature&rsquo;s layers, where novel properties arise through interactions at different Nested Scales of Complexity.<br>
</p>

<p>
The idea that a Theory of Everything (TOE) or Grand Unified Theory (GUT) can be derived from physics alone overlooks how emergent properties arise from complex interactions across various Scales. Integrated theories of complex adaptive systems, rather than purely physical theories, might offer more comprehensive insights.<br>
</p>

<p>
Thus, the Protoverse project has to transcend traditional disciplinary boundaries, integrating ideas from computational philosophy, evolutionary theory, process philosophy, automata theory, complex systems, chaos theory, quantum theory, and systems architecture with emphasis on concurrency and massive parallelism. This interdisciplinary approach acknowledges the richness of reality and its many scales.<br>
</p>
</div>
</div>
<div id="outline-container-org163c72d" class="outline-3">
<h3 id="org163c72d"><a href="#org163c72d">But isn&rsquo;t that mere speculation? Not science?</a></h3>
<div class="outline-text-3" id="text-org163c72d">
<p>
You are right, the project is not science, but rather an expedition or field trip. Speculation has its place in the ongoing feedback loop and is intrinsic to philosophical, mathematical and scientific methods, which aims to realize the Protoverse by means of engineering.<br>
</p>
</div>
</div>
<div id="outline-container-orgdea4e06" class="outline-3">
<h3 id="orgdea4e06"><a href="#orgdea4e06">How do you fund that?</a></h3>
<div class="outline-text-3" id="text-orgdea4e06">
<p>
The Protoverse project will at any time receive the attention it deserves and the degree of resources needed.<br>
</p>

<ol class="org-ol">
<li>The first rule of the Protoverse is: You do not talk about the Protoverse.<br></li>
<li>The second rule of the Protoverse is: You do not talk about the Protoverse.<br></li>
<li>Third rule: Rules are subject to evolution and lead to higher-order, emergent phenomena.<br></li>
</ol>
</div>
</div>
<div id="outline-container-orgcfa0d5b" class="outline-3">
<h3 id="orgcfa0d5b"><a href="#orgcfa0d5b">Don&rsquo;t you have ehical concerns?</a></h3>
<div class="outline-text-3" id="text-orgcfa0d5b">
<p>
At this point, not really &#x2013; that would be overreaching. But eventually, yes. That&rsquo;s why there are <a href="ethics.protoverse.project.html">Ethical Guidelines</a> in the making.<br>
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<div class="footer">Published by <span class="author"><a href="/bio.html">Dan Dee</a></span></div>
<script defer src="/static/footer.js"></script>
</div>
</body>
</html>
